In [1]:
import pandas as pd
# create a sample DataFrame
df = pd.DataFrame({'Name': ['John Doe', 'Jane Smith', 'Bob Johnson']})
# split the Name column into two columns
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', expand=True)
# view the updated DataFrame
print(df)

          Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson

In [3]:
import pandas as pd
data = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}
df = pd.DataFrame(data)
df

    name  age
0  Sally   50
1   Mary   40
2   John   30

In [5]:
# 把資料的取得看成是查詢資料的操作
print(df.query('age > 35'))

    name  age
0  Sally   50
1   Mary   40

In [7]:
# 使用欄位名稱取得資料
import pandas as pd
# Create a simple dataframe
data = {'Name': ['John', 'Anna', 'Peter'],
        'Age': [28, 24, 22]}
df = pd.DataFrame(data)
# Access the 'Name' column
print(df['Name'])

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [9]:
# Using loc
print(df.loc[:, 'Name'])

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [11]:
# Using iloc
print(df.iloc[:, 0])

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [13]:
# Using at
print(df.at[0, 'Name'])

John

In [15]:
# Using iat
print(df.iat[0, 0])

John

In [17]:
# 取得多個資料值的方法
print(df[['Name', 'Age']])

    Name  Age
0   John   28
1   Anna   24
2  Peter   22

In [19]:
# Using loc
print(df.loc[:, ['Name', 'Age']])

    Name  Age
0   John   28
1   Anna   24
2  Peter   22

In [21]:
# Using iloc
print(df.iloc[:, [0, 1]])

    Name  Age
0   John   28
1   Anna   24
2  Peter   22